#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Mon Jan 30 09:09:26 2023

add_design "C:/Users/w/Desktop/MES50HP/2_demo/01_led_test/source/Desktop/01_led_test.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module led_test
synthesize -ads -selected_syn_tool_opt 2 
add_constraint "C:/Users/w/Desktop/MES50HP/2_demo/01_led_test/led_test.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module led_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "C:/Users/w/Desktop/MES50HP/2_demo/01_led_test/synthesize/led_test_syn.fic"
add_simulation "C:/Users/w/Desktop/MES50HP/2_demo/01_led_test/source/Desktop/tb_led_test.v"
add_simulation "C:/Users/w/Desktop/MES50HP/2_demo/01_led_test/source/source/Desktop/01_led_test.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module led_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_simulation "C:/Users/w/Desktop/MES50HP/2_demo/01_led_test/source/source/Desktop/01_led_test.v"
add_simulation "C:/Users/w/Desktop/MES50HP/2_demo/01_led_test/source/source/Desktop/01_led_test.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module led_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module led_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module led_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module led_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "C:/Users/G1320/Desktop/01_led_test/01_led_test/source/led_tb.v"
remove_simulation -force "C:/Users/G1320/Desktop/01_led_test/01_led_test/source/led_tb.v"
add_simulation "C:/Users/G1320/Desktop/01_led_test/01_led_test/source/matrix_tb.v"
remove_simulation -force "C:/Users/G1320/Desktop/01_led_test/01_led_test/source/source/Desktop/01_led_test.v"
remove_simulation -force "C:/Users/G1320/Desktop/01_led_test/01_led_test/source/Desktop/tb_led_test.v"
add_simulation "C:/Users/G1320/Desktop/01_led_test/01_led_test/source/matrix_3_3.v"
add_design C:/Users/G1320/Desktop/01_led_test/01_led_test/ipcore/fifo_matrix_buf/fifo_matrix_buf.idf
remove_simulation "C:/Users/G1320/Desktop/01_led_test/01_led_test/source/matrix_3_3.v"
add_simulation "C:/Users/G1320/Desktop/matrix_3_3.v"
add_design "C:/Users/G1320/Desktop/matrix_3_3.v"
remove_simulation "C:/Users/G1320/Desktop/matrix_3_3.v"
add_simulation "C:/Users/G1320/Desktop/matrix_3_3.v"
remove_simulation "C:/Users/G1320/Desktop/matrix_3_3.v"
remove_design -verilog "C:/Users/G1320/Desktop/matrix_3_3.v"
remove_simulation "C:/Users/G1320/Desktop/01_led_test/01_led_test/source/matrix_tb.v"
add_simulation "C:/Users/G1320/Desktop/matrix_tb.v"
add_simulation "C:/Users/G1320/Desktop/matrix_3_3.v"
remove_design -force C:/Users/G1320/Desktop/01_led_test/01_led_test/ipcore/fifo_matrix_buf/fifo_matrix_buf.idf
add_design C:/Users/G1320/Desktop/01_led_test/01_led_test/ipcore/FIFO/matrix_fifo_buf.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module led_test
remove_design -force C:/Users/G1320/Desktop/01_led_test/01_led_test/ipcore/FIFO/matrix_fifo_buf.idf
add_design C:/Users/G1320/Desktop/01_led_test/01_led_test/ipcore/fifo/matrix_fifo_buf.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module led_test
remove_design -force C:/Users/G1320/Desktop/01_led_test/01_led_test/ipcore/fifo/matrix_fifo_buf.idf
add_design C:/Users/G1320/Desktop/01_led_test/01_led_test/ipcore/fifo/matrix_fifo_buf.idf
remove_design -force C:/Users/G1320/Desktop/01_led_test/01_led_test/ipcore/fifo/matrix_fifo_buf.idf
add_design C:/Users/G1320/Desktop/01_led_test/01_led_test/ipcore/fifo/matrix_fifo_buf.idf
remove_design -force C:/Users/G1320/Desktop/01_led_test/01_led_test/ipcore/fifo/matrix_fifo_buf.idf
add_design C:/Users/G1320/Desktop/01_led_test/01_led_test/ipcore/fifo/matrix_fifo_buf.idf
remove_design -force C:/Users/G1320/Desktop/01_led_test/01_led_test/ipcore/fifo/matrix_fifo_buf.idf
add_design C:/Users/G1320/Desktop/01_led_test/01_led_test/ipcore/fifo/matrix_fifo_buf.idf
remove_design -force C:/Users/G1320/Desktop/01_led_test/01_led_test/ipcore/fifo/matrix_fifo_buf.idf
add_design C:/Users/G1320/Desktop/01_led_test/01_led_test/ipcore/fifo/matrix_fifo_buf.idf
add_simulation "C:/Users/G1320/Desktop/01_led_test/01_led_test/source/source/Desktop/matrix_tb.v"
add_simulation "C:/Users/G1320/Desktop/01_led_test/01_led_test/source/source/Desktop/matrix_3_3.v"
remove_simulation "C:/Users/G1320/Desktop/matrix_tb.v"
remove_simulation "C:/Users/G1320/Desktop/matrix_3_3.v"
